uhnp/src/InformationRegisters/ОтражениеДокументовПоШаблонам/ОтражениеДокументовПоШаблонам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтражениеДокументовПоШаблонам</name>
  <resources>
    <name>УдалитьСценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаписиДоЗакрытияПериода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПериодОтбора</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <resources>
    <name>ДокументПервогоОтражения</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаписиПослеЗакрытияПериода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДокументСторноПервогоОтражения</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
    </type>
  </resources>
  <resources>
    <name>ПериодОтражения</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <resources>
    <name>ДокументПоследнегоОтражения</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытияПериодаОтражения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроведениеОтменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтражениеФоновымЗаданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетнаяПолитика</name>
    <type>
      <types>DocumentRef.УчетнаяПолитикаМСФО</types>
    </type>
  </resources>
  <resources>
    <name>ОтраженоВСледующемПериоде</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособТрансляции</name>
    <type>
      <types>EnumRef.СпособыТрансляции</types>
    </type>
  </resources>
  <dimensions>
    <name>ИсходныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбработкаВыполнена</name>
    <type>
      <types>EnumRef.ДаНет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонОперации</name>
    <type>
      <types>CatalogRef.ШаблоныТрансформационныхКорректировок</types>
      <types>CatalogRef.ШаблоныТрансляций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Трансляция</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтражения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ДокументыНеОтражаемыеПоШаблонам/ДокументыНеОтражаемыеПоШаблонам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыНеОтражаемыеПоШаблонам</name>
  <resources>
    <name>НеОтражатьМСФО</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеОтражатьНСБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаПР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаВР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаУУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаФО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

uhnp/src/AccountingRegisters/МСФО/МСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>МСФО</name>
  <chartOfAccounts>ChartOfAccounts.МСФО</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОпераций</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>СуммаВВалютеУчета</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалютеОтчетности</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетДтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоДт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоКт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

uhnp/src/Enums/ДаНет/ДаНет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДаНет</name>
  <enumValues>
    <name>да</name>
  </enumValues>
  <enumValues>
    <name>нет</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/ОтражениеДокументовПоШаблонам/Forms/ФормаОтражениеДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьТекстЗапросаДинамическогоСписка();
	
	ИсходныйДокумент=Параметры.ИсходныйДокумент;
	ПроверитьОтражениеПоШаблонам();
	УстановитьОтборыСписков(); 
	
	ДанныеОбъекта=ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсходныйДокумент,"Организация,Проведен,ПометкаУдаления");
	ИсходныйДокументПометкаУдаления=ДанныеОбъекта.ПометкаУдаления;
	ИсходныйДокументПроведен=(НЕ ИсходныйДокумент.Метаданные().Проведение=Метаданные.СвойстваОбъектов.Проведение.Разрешить) ИЛИ ДанныеОбъекта.Проведен;
	Организация=ДанныеОбъекта.Организация;
	
	ОтобразитьНеобходимостьПерезаполнения();
	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьОтражениеПоШаблонам()
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ДокументыНеОтражаемыеПоШаблонам.НеОтражатьМСФО КАК НеОтражатьМСФО,
	|	ДокументыНеОтражаемыеПоШаблонам.НеОтражатьНСБУ КАК НеОтражатьНСБУ
	|ИЗ
	|	РегистрСведений.ДокументыНеОтражаемыеПоШаблонам КАК ДокументыНеОтражаемыеПоШаблонам
	|ГДЕ
	|	ДокументыНеОтражаемыеПоШаблонам.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ",ИсходныйДокумент);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		Элементы.ИзменитьОтражениеПоШаблонам.Пометка=Результат.НеОтражатьМСФО;
		Элементы.ИзменитьОтражениеПоНСБУ.Пометка=Результат.НеОтражатьНСБУ;
		
	Иначе
		
		Элементы.ИзменитьОтражениеПоШаблонам.Пометка=ЛОЖЬ;
		Элементы.ИзменитьОтражениеПоНСБУ.Пометка=ЛОЖЬ;
		
	КонецЕсли;
	
	ЕстьДвиженияХозрасчетный=Ложь;
	
	Для Каждого Движение ИЗ ИсходныйДокумент.Метаданные().Движения Цикл
		
		Если Движение.ПолноеИмя()="РегистрБухгалтерии.Хозрасчетный" Тогда
			
			ЕстьДвиженияХозрасчетный=Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
			
	Элементы.ИзменитьОтражениеПоНСБУ.Видимость=ЕстьДвиженияХозрасчетный;		
			
	УстановитьТекстКнопкиОтраженияПоШаблонам();
	УстановитьТекстКнопкиОтраженияПоНСБУ();
			
КонецПроцедуры // ПроверитьОтражениеПоШаблонам()

&НаСервере
Процедура УстановитьТекстКнопкиОтраженияПоШаблонам()
	
	Если Элементы.ИзменитьОтражениеПоШаблонам.Пометка Тогда
		
		Элементы.ИзменитьОтражениеПоШаблонам.ЦветТекста=Новый Цвет(255,0,0);
		Элементы.ИзменитьОтражениеПоШаблонам.Шрифт=Новый Шрифт(Элементы.ИзменитьОтражениеПоШаблонам.Шрифт, , , Истина);
		Элементы.ИзменитьОтражениеПоШаблонам.Заголовок=НСтр("ru = 'Включить отражение по МСФО'");
		Элементы.ИзменитьОтражениеПоШаблонам.Картинка=БиблиотекаКартинок.Провести;
		Элементы.ГруппаПерезаполнение.Видимость=Ложь;
		
	Иначе
		
		Элементы.ИзменитьОтражениеПоШаблонам.ЦветТекста=Новый Цвет(77,77,77);
		Элементы.ИзменитьОтражениеПоШаблонам.Шрифт=Новый Шрифт(Элементы.ИзменитьОтражениеПоШаблонам.Шрифт, , , Ложь);
		Элементы.ИзменитьОтражениеПоШаблонам.Заголовок=НСтр("ru = 'Отключить отражение по МСФО'");
		Элементы.ИзменитьОтражениеПоШаблонам.Картинка=БиблиотекаКартинок.ОтменаПроведения;
		
		Элементы.ГруппаПерезаполнение.Видимость=Истина;
		
	КонецЕсли;
		
КонецПроцедуры // УстановитьТекстКнопкиОтраженияПоШаблонам()

&НаСервере
Процедура УстановитьТекстКнопкиОтраженияПоНСБУ()
	
	Если Элементы.ИзменитьОтражениеПоНСБУ.Пометка Тогда
		
		Элементы.ИзменитьОтражениеПоНСБУ.ЦветТекста=Новый Цвет(255,0,0);
		Элементы.ИзменитьОтражениеПоНСБУ.Шрифт=Новый Шрифт(Элементы.ИзменитьОтражениеПоШаблонам.Шрифт, , , Истина);
		Элементы.ИзменитьОтражениеПоНСБУ.Заголовок=НСтр("ru = 'Включить отражение по РСБУ'");
		Элементы.ИзменитьОтражениеПоНСБУ.Картинка=БиблиотекаКартинок.Провести;
				
	Иначе
		
		Элементы.ИзменитьОтражениеПоНСБУ.ЦветТекста=Новый Цвет(77,77,77);
		Элементы.ИзменитьОтражениеПоНСБУ.Шрифт=Новый Шрифт(Элементы.ИзменитьОтражениеПоШаблонам.Шрифт, , , Ложь);
		Элементы.ИзменитьОтражениеПоНСБУ.Заголовок=НСтр("ru = 'Отключить отражение по РСБУ'");
		Элементы.ИзменитьОтражениеПоНСБУ.Картинка=БиблиотекаКартинок.ОтменаПроведения;
				
	КонецЕсли;
		
КонецПроцедуры // УстановитьТекстКнопкиОтраженияПоНСБУ() 


&НаСервере
Процедура УстановитьОтборыСписков()
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	Трансляция.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Трансляция КАК Трансляция
	|ГДЕ
	|	Трансляция.ИсходныйДокумент = &ИсходныйДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТрансформационнаяКорректировка.Ссылка
	|ИЗ
	|	Документ.ТрансформационнаяКорректировка КАК ТрансформационнаяКорректировка
	|ГДЕ
	|	ТрансформационнаяКорректировка.ИсходныйДокумент = &ИсходныйДокумент";
	
	Запрос.УстановитьПараметр("ИсходныйДокумент",ИсходныйДокумент);
	
	СписокРегистраторов=Новый СписокЗначений;
	СписокРегистраторов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	СписокРегистраторов.Добавить(ИсходныйДокумент);
	
	СписокМСФО.Параметры.УстановитьЗначениеПараметра("СписокРегистраторов",СписокРегистраторов);
	СписокМСФО.Параметры.УстановитьЗначениеПараметра("ИсходныйДокумент",ИсходныйДокумент);
	
	СписокМСФО.Параметры.УстановитьЗначениеПараметра("ТекстИсходныйДокумент",Нстр("ru = 'Проведение исходного документа'"));
	СписокМСФО.Параметры.УстановитьЗначениеПараметра("ТекстПервогоОтражения",Нстр("ru = 'Отражение до закрытия периода'"));
	СписокМСФО.Параметры.УстановитьЗначениеПараметра("ТекстСторно",Нстр("ru = 'Сторно отражения до закрытия периода'"));
	СписокМСФО.Параметры.УстановитьЗначениеПараметра("ТекстПоследнегоОтражения",Нстр("ru = 'Отражение после закрытия периода'"));
	
	ОбщегоНазначенияКлиентСерверУХ.УстановитьЭлементОтбора(ОтражениеДокументовПоШаблонам.Отбор,"ИсходныйДокумент",ИсходныйДокумент,ВидСравненияКомпоновкиДанных.Равно,,Истина);

		
КонецПроцедуры // УстановитьОтборыСписков()

Процедура СформироватьТекстЗапросаДинамическогоСписка()
	
	МаксКоличествоСубконто=Метаданные.ПланыСчетов.МСФО.МаксКоличествоСубконто;
	
	ТекстЗапроса="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтражениеДокументовПоШаблонам.ДокументПервогоОтражения КАК ДокументПервогоОтражения,
	|	ОтражениеДокументовПоШаблонам.ДокументСторноПервогоОтражения КАК ДокументСторноПервогоОтражения,
	|	ОтражениеДокументовПоШаблонам.ДокументПоследнегоОтражения КАК ДокументПоследнегоОтражения
	|ПОМЕСТИТЬ ОтражениеДокументов
	|ИЗ
	|	РегистрСведений.ОтражениеДокументовПоШаблонам КАК ОтражениеДокументовПоШаблонам
	|ГДЕ
	|	ОтражениеДокументовПоШаблонам.ИсходныйДокумент = &ИсходныйДокумент
	|	И ОтражениеДокументовПоШаблонам.ОбработкаВыполнена = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрБухгалтерииМСФОДвиженияССубконто.Период КАК Период,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.Регистратор КАК Регистратор,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.НомерСтроки КАК НомерСтроки,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.Активность КАК Активность,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.СчетДт КАК СчетДт,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.СчетКт КАК СчетКт,";
	
	Для Индекс=1 По МаксКоличествоСубконто Цикл
		
		ТекстЗапроса=ТекстЗапроса+"	
		|	РегистрБухгалтерииМСФОДвиженияССубконто.СубконтоДт"+Индекс+" КАК СубконтоДт"+Индекс+",
		|	РегистрБухгалтерииМСФОДвиженияССубконто.ВидСубконтоДт"+Индекс+" КАК ВидСубконтоДт"+Индекс+",
		|	РегистрБухгалтерииМСФОДвиженияССубконто.СубконтоКт"+Индекс+" КАК СубконтоКт"+Индекс+",
		|	РегистрБухгалтерииМСФОДвиженияССубконто.ВидСубконтоКт"+Индекс+" КАК ВидСубконтоКт"+Индекс+",";
		
	КонецЦикла;
	
	ТекстЗапроса=ТекстЗапроса+"
	|	РегистрБухгалтерииМСФОДвиженияССубконто.Организация КАК Организация,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.ВалютаДт КАК ВалютаДт,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.ВалютаКт КАК ВалютаКт,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.Сценарий КАК Сценарий,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.ВидОперации КАК ВидОперации,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.СуммаВВалютеУчета КАК СуммаВВалютеУчета,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.СуммаВВалютеОтчетности КАК СуммаВВалютеОтчетности,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.СуммаВВалютеДт КАК СуммаВВалютеДт,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.СуммаВВалютеКт КАК СуммаВВалютеКт,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.КоличествоДт КАК КоличествоДт,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.КоличествоКт КАК КоличествоКт,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.Содержание КАК Содержание,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.СчетДтИсточник КАК СчетДтИсточник,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.СчетКтИсточник КАК СчетКтИсточник,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.ПравилоДт КАК ПравилоДт,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.ПравилоКт КАК ПравилоКт,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.МоментВремени КАК МоментВремени,
	|	ЕСТЬNULL(РегистрБухгалтерииМСФОДвиженияССубконто.СчетДт.Количественный, ЛОЖЬ) КАК СчетДтКоличественный,
	|	ЕСТЬNULL(РегистрБухгалтерииМСФОДвиженияССубконто.СчетКт.Количественный, ЛОЖЬ) КАК СчетКтКоличественный,
	|	ЕСТЬNULL(РегистрБухгалтерииМСФОДвиженияССубконто.СчетДт.Валютный, ЛОЖЬ) КАК СчетДтВалютный,
	|	ЕСТЬNULL(РегистрБухгалтерииМСФОДвиженияССубконто.СчетКт.Валютный, ЛОЖЬ) КАК СчетКтВалютный,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.ПодразделениеДт КАК ПодразделениеДт,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.ПодразделениеКт КАК ПодразделениеКт,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.НаправлениеДеятельностиДт КАК НаправлениеДеятельностиДт,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.НаправлениеДеятельностиКт КАК НаправлениеДеятельностиКт,
	|	РегистрБухгалтерииМСФОДвиженияССубконто.Регистратор.ШаблонКорректировки КАК ШаблонКорректировки,
	|	ВЫБОР
	|		КОГДА РегистрБухгалтерииМСФОДвиженияССубконто.Регистратор = &ИсходныйДокумент
	|			ТОГДА &ТекстИсходныйДокумент
	|		КОГДА НЕ ПервоеОтражение.ДокументПервогоОтражения ЕСТЬ NULL
	|			ТОГДА &ТекстПервогоОтражения
	|		КОГДА НЕ СторноПервогоОтражения.ДокументСторноПервогоОтражения ЕСТЬ NULL
	|			ТОГДА &ТекстСторно
	|		ИНАЧЕ &ТекстПоследнегоОтражения
	|	КОНЕЦ КАК ТекстКомментария,
	|	ВЫБОР
	|		КОГДА РегистрБухгалтерииМСФОДвиженияССубконто.Регистратор = &ИсходныйДокумент
	|			ТОГДА 0
	|		КОГДА НЕ ПервоеОтражение.ДокументПервогоОтражения ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА НЕ СторноПервогоОтражения.ДокументСторноПервогоОтражения ЕСТЬ NULL
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ПорядокОтражения
	|ИЗ
	|	РегистрБухгалтерии.МСФО.ДвиженияССубконто(, , Регистратор В (&СписокРегистраторов), , ) КАК РегистрБухгалтерииМСФОДвиженияССубконто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтражениеДокументов КАК ПервоеОтражение
	|		ПО РегистрБухгалтерииМСФОДвиженияССубконто.Регистратор = ПервоеОтражение.ДокументПервогоОтражения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтражениеДокументов КАК СторноПервогоОтражения
	|		ПО РегистрБухгалтерииМСФОДвиженияССубконто.Регистратор = СторноПервогоОтражения.ДокументСторноПервогоОтражения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтражениеДокументов КАК ПоследнееОтражение
	|		ПО РегистрБухгалтерииМСФОДвиженияССубконто.Регистратор = ПоследнееОтражение.ДокументПоследнегоОтражения";
	
	ЭтотОбъект.СписокМСФО.ТекстЗапроса=ТекстЗапроса;
	
	Индекс=МаксКоличествоСубконто;
	
	Пока Индекс>0 Цикл
		
		ЭлементДт=?(Индекс=МаксКоличествоСубконто,Неопределено,Элементы["СубконтоДт"+(Индекс+1)]);	
		КолонкаСубконтоДт=ЭтотОбъект.Элементы.Вставить("СубконтоДт"+Индекс,Тип("ПолеФормы"),ЭтотОбъект.Элементы.ГруппаСубконтоДт,ЭлементДт);	
		КолонкаСубконтоДт.ПутьКДанным="СписокМСФО.СубконтоДт"+Индекс;
		КолонкаСубконтоДт.Вид=ВидПоляФормы.ПолеНадписи;
		КолонкаСубконтоДт.Ширина=20;
		КолонкаСубконтоДт.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		ЭлементКт=?(Индекс=МаксКоличествоСубконто,Неопределено,Элементы["СубконтоКт"+(Индекс+1)]);	
		КолонкаСубконтоКт=ЭтотОбъект.Элементы.Вставить("СубконтоКт"+Индекс,Тип("ПолеФормы"),ЭтотОбъект.Элементы.ГруппаСубконтоКт,ЭлементКт);	
		КолонкаСубконтоКт.ПутьКДанным="СписокМСФО.СубконтоКт"+Индекс;
		КолонкаСубконтоКт.Вид=ВидПоляФормы.ПолеНадписи;
		КолонкаСубконтоКт.Ширина=20;
		КолонкаСубконтоКт.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Нет;
	
		Индекс=Индекс-1;
		
	КонецЦикла;	
	
КонецПроцедуры // СформироватьТекстДинамическогоСписка() 

&НаКлиенте
Процедура ОтражениеДокументовПоШаблонамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
		
	Если Поле.Имя="ДокументПервогоОтражения"
		ИЛИ Поле.Имя="ДокументПоследнегоОтражения"
		ИЛИ Поле.Имя="ДокументСторноПервогоОтражения" Тогда
		
		СтандартнаяОбработка=Ложь;
		РабочийДокумент=Элементы.ОтражениеДокументовПоШаблонам.ТекущиеДанные[Поле.Имя];
		
		Если НЕ ЗначениеЗаполнено(РабочийДокумент) Тогда
			Возврат;
		КонецЕсли;
		
		ПоказатьЗначение(,РабочийДокумент);
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыОтчетаПоПроводкам(СтруктураПараметров)
	
	Возврат Обработки.КорректировкиЗначенийПоказателей.ПолучитьПараметрыОтчетаПоПроводкам(СтруктураПараметров.Ключ,СтруктураПараметров.НомерПроводки);
			
КонецФункции // ПолучитьПараметрыОтчетаПоПроводкам()

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя="ПравилоДт" И ЗначениеЗаполнено(Элементы.СписокМСФО.ТекущиеДанные.ПравилоДт) Тогда
		
		СтандартнаяОбработка=Ложь;
		ПоказатьЗначение(,Элементы.СписокМСФО.ТекущиеДанные.ПравилоДт); 
		
	ИначеЕсли Поле.Имя="ПравилоКт" И ЗначениеЗаполнено(Элементы.СписокМСФО.ТекущиеДанные.ПравилоКт)  Тогда
		
		ИсточникДт=ПолучитьИсточникДт(Элементы.СписокМСФО.ТекущиеДанные.ПравилоКт);
		
		СтандартнаяОбработка=Ложь;
		ПоказатьЗначение(,ИсточникДт);
		
	ИначеЕсли ТипЗнч(Элементы.СписокМСФО.ТекущиеДанные.ШаблонКорректировки)=Тип("СправочникСсылка.ШаблоныТрансляций") Тогда
		
		СтруктураПараметров=Новый Структура;
		СтруктураПараметров.Вставить("Ключ",Элементы.СписокМСФО.ТекущиеДанные.Регистратор);
		СтруктураПараметров.Вставить("НомерПроводки",Элементы.СписокМСФО.ТекущиеДанные.НомерСтроки);
		
		ПараметрыОтчета=ПолучитьПараметрыОтчетаПоПроводкам(СтруктураПараметров);
		
		Если НЕ ПараметрыОтчета=Неопределено Тогда
			
			СтандартнаяОбработка=Ложь;
			
			ОткрытьФорму("Отчет.ОтчетПоРегиструБухгалтерииБД.ФормаОбъекта",ПараметрыОтчета,ЭтаФорма,Новый УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.Независимый);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьИсточникДт(ИсточникКт)
	
	ДанныеИсточника=УправлениеОтчетамиУХ.ДанныеИсточникаДляСтороныПроводки(ИсточникКт);
	
	Возврат ДанныеИсточника[0].Ссылка; 
	
КонецФункции // ПолучитьИсточникДт() 

&НаСервере
Функция ИзменитьОтражениеПоШаблонамНаСервере()

	Отказ=Ложь;
	
	Если Элементы.ИзменитьОтражениеПоШаблонам.Пометка Тогда
		
		КорректировкиЗначенийПоказателей32.ВключитьИОтразитьПоШаблонам(ИсходныйДокумент,Отказ);
		
	Иначе
		
		КорректировкиЗначенийПоказателей32.ОтключитьИОтменитьОтражение(ИсходныйДокумент,Отказ);
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Элементы.ИзменитьОтражениеПоШаблонам.Пометка=НЕ Элементы.ИзменитьОтражениеПоШаблонам.Пометка;
		
		УстановитьОтборыСписков();
		
		Элементы.ОтражениеДокументовПоШаблонам.Обновить();
		Элементы.СписокМСФО.Обновить();
		
		УстановитьТекстКнопкиОтраженияПоШаблонам();
		
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции 

&НаКлиенте
Процедура ИзменитьОтражениеПоШаблонам(Команда)
		
	Если ИзменитьОтражениеПоШаблонамНаСервере() Тогда
		
		Оповестить("ИзмененоОтражениеДокументаПоШаблонам");
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтобразитьНеобходимостьПерезаполнения()
			
	ТекстНеобходимость=КорректировкиЗначенийПоказателей32.ОпределитьНеобходимостьПерезаполнения(ИсходныйДокумент);
		
	Если ПустаяСтрока(ТекстНеобходимость) Тогда
		
		Элементы.ДекорацияПерезаполнение.Видимость=Ложь;
		
	Иначе
		
		Элементы.ДекорацияПерезаполнение.Заголовок=ТекстНеобходимость; 
		Элементы.ДекорацияПерезаполнение.Видимость=Истина;
		
	КонецЕсли;
			
КонецПроцедуры // ОтобразитьНеобходимостьПерезаполнения()

&НаКлиенте
Процедура ВыполнитьОтражениеОбъекта(Команда)
		
	Если ИсходныйДокументПометкаУдаления Тогда
		
		ПоказатьПредупреждение(,Нстр("ru = 'Исходный документ помечен на удаление. Отражение по шаблонам невозможно.'"),60);
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ИсходныйДокументПроведен Тогда
		
		ПоказатьПредупреждение(,Нстр("ru = 'Исходный документ не проведен. Отражение по шаблонам невозможно.'"),60);
		Возврат;
		
	КонецЕсли;

	ВыполнитьОтражениеДокумента();
	
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОтражениеДокумента()
		
	МассивДокументов=Новый Массив;
	МассивДокументов.Добавить(ИсходныйДокумент);
	КорректировкиЗначенийПоказателей32.ВыполнитьОбработкуМассиваДокументов(МассивДокументов,Истина);
	
	ДокументОбъект=ИсходныйДокумент.ПолучитьОбъект();
	Обработки.КорректировкиЗначенийПоказателей.ПроверитьОбработатьКорректировкиПоШаблонам(ДокументОбъект,Ложь);
	
	Элементы.СписокМСФО.Обновить();
	Элементы.ОтражениеДокументовПоШаблонам.Обновить();
	ОтобразитьНеобходимостьПерезаполнения();
	
	ДокументОбъект=Неопределено;
	
	
КонецПроцедуры // ВыполнитьОтражениеДокумента() 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="ЗаписаноПравилоНастройкиТрансляции" Тогда
		
		ОтобразитьНеобходимостьПерезаполнения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьОтражениеПоНСБУНаСервере()

	Отказ=Ложь;
	
	Если Элементы.ИзменитьОтражениеПоНСБУ.Пометка Тогда
		
		КорректировкиЗначенийПоказателей32.ВключитьОтражениеПоНСБУ(ИсходныйДокумент,Отказ);
		
	Иначе
		
		КорректировкиЗначенийПоказателей32.ОтключитьОтражениеПоНСБУ(ИсходныйДокумент,Отказ);
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Элементы.ИзменитьОтражениеПоНСБУ.Пометка=НЕ Элементы.ИзменитьОтражениеПоНСБУ.Пометка;		
		УстановитьТекстКнопкиОтраженияПоНСБУ();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтражениеПоНСБУ(Команда)
	ИзменитьОтражениеПоНСБУНаСервере();
КонецПроцедуры
